cli/awk.html
<!DOCTYPE html>
<html>
<head>
<title>AWK</title>
<!-- 2018-02-06 Tue 23:22 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">AWK</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 工作方式</a>
<ul>
<li><a href="#sec-1-1">1.1. awk 常用的格式</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 脚本范式</a>
<ul>
<li><a href="#sec-2-1">2.1. 产生伪随机数</a></li>
<li><a href="#sec-2-2">2.2. 打印字段</a></li>
<li><a href="#sec-2-3">2.3. 字段匹配</a></li>
<li><a href="#sec-2-4">2.4. 行匹配</a></li>
<li><a href="#sec-2-5">2.5. 内容重定向</a></li>
<li><a href="#sec-2-6">2.6. 使用数组</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. 统计每个用户的进程占了多少内存</a></li>
</ul>
</li>
<li><a href="#sec-2-7">2.7. 使用变量</a>
<ul>
<li><a href="#sec-2-7-1">2.7.1. 字符串连接</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 内建变量</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-06 23:22:41</td>
</tr>
</tbody>
</table>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 工作方式</a>
<ul>
<li><a href="#sec-1-1">1.1. awk 常用的格式</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 脚本范式</a>
<ul>
<li><a href="#sec-2-1">2.1. 产生伪随机数</a></li>
<li><a href="#sec-2-2">2.2. 打印字段</a></li>
<li><a href="#sec-2-3">2.3. 字段匹配</a></li>
<li><a href="#sec-2-4">2.4. 行匹配</a></li>
<li><a href="#sec-2-5">2.5. 内容重定向</a></li>
<li><a href="#sec-2-6">2.6. 使用数组</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. 统计每个用户的进程占了多少内存</a></li>
</ul>
</li>
<li><a href="#sec-2-7">2.7. 使用变量</a>
<ul>
<li><a href="#sec-2-7-1">2.7.1. 字符串连接</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 内建变量</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 工作方式</h2>
<div class="outline-text-2" id="text-1">
<p>
awk 的工作方式是读取数据文件，将每一行数据视为一条记录(record)，每笔记录以字段分隔符分成若干字段，然后输出各个字段的值。
</p>

<p>
awk 对每一条记录，都会套用一个 <code>/pattern/{operation}</code> 。如果该行符合 pattern ，就执行指定的 operation 。
</p>

<p>
pattern 或 operation 之一，可以省略：
</p>

<ul class="org-ul">
<li>如果只有 pattern ，表示要显示符合样式的数据行
</li>
<li>如果只有 operation ，表示对每一数据行都执行该项操作
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> awk 常用的格式</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><code>awk /pattern/ &lt;filename&gt;</code> ：把符合样式的数据行显示出来
</li>

<li><code>awk '{operation}' filename</code> ：对每一行都执行{}中的操作
</li>

<li>awk '样式{操作}' 文件：对符合样式的数据行，执行{}中的操作
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 脚本范式</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 产生伪随机数</h3>
<div class="outline-text-3" id="text-2-1">
<p>
产生一个范围在 0-1 之间的伪随机数，（同一秒内生成的随机数相同）
</p>

<div class="org-src-container">

<pre class="src src-sh">echo | awk '{ srand(); print rand() }'
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 打印字段</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">awk '{ print $1, $2, $3 }' &lt;filename&gt;
awk '{ print $1$2, $3 }' &lt;filename&gt;

# any expression can be after $ to denote a field number
awk '{ print NF, $1, $(NF-1) }' &lt;filename&gt;

awk '{ print }' &lt;filename&gt;                               # 相当于 cat
awk '{ tmp = $1; $1 = $2; $2 = tmp; print }' &lt;filename&gt;  # 相当于 print $1,$2,...,$NF
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 字段匹配</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh">awk '$3~/hello/ {print NR }' file
awk '$3!~/hello/ { print NR }' file
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 行匹配</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-sh">awk '!/hello/' &lt;file&gt;           # 相当于 grep -v
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 内容重定向</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-sh">awk 'NR!=1 { if($6 ~ /TIME|ESTABLISHED/) print &gt; "1.txt";
             else if($6 ~ /LISTEN/) print &gt; "2.txt";
             else print &gt; "3.txt" }' netstat.txt
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 使用数组</h3>
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> 统计每个用户的进程占了多少内存</h4>
<div class="outline-text-4" id="text-2-6-1">
<div class="org-src-container">

<pre class="src src-sh">ps aux | awk 'NR!=1 { a[$1]+=$6; } END{ for(i in a) print i ", " a[i]"KB"; }'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 使用变量</h3>
<div class="outline-text-3" id="text-2-7">
</div><div id="outline-container-sec-2-7-1" class="outline-4">
<h4 id="sec-2-7-1"><span class="section-number-4">2.7.1</span> 字符串连接</h4>
<div class="outline-text-4" id="text-2-7-1">
<div class="org-src-container">

<pre class="src src-sh">cat emp.data  | awk '{ names = names $1 " " } END { print names }'
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 内建变量</h2>
<div class="outline-text-2" id="text-3">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">变量</th>
<th scope="col" class="left">值</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">$0</td>
<td class="left">整个行的内容</td>
</tr>

<tr>
<td class="left">$1 - $n</td>
<td class="left">当前记录的第 n 个字段，字段间由 FS 分隔</td>
</tr>

<tr>
<td class="left">FS</td>
<td class="left">输入字段分隔符，默认是空格或 Tab</td>
</tr>

<tr>
<td class="left">NF</td>
<td class="left">当前记录中的字段个数</td>
</tr>

<tr>
<td class="left">NR</td>
<td class="left">已读出的记录数，即行号，从 1 开始，若有多个文件，则不间断累加</td>
</tr>

<tr>
<td class="left">FNR</td>
<td class="left">当前记录数，与 NR 不同的是，这个值会是各个文件自己的行号</td>
</tr>

<tr>
<td class="left">RS</td>
<td class="left">输入记录分隔符，默认为换行符</td>
</tr>

<tr>
<td class="left">OFS</td>
<td class="left">输出字段分隔符，默认是空格</td>
</tr>

<tr>
<td class="left">ORS</td>
<td class="left">输出记录分隔符，默认为换行符</td>
</tr>

<tr>
<td class="left">FILENAME</td>
<td class="left">当前输入文件的名字</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>